---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginn2
source: html/377a6b2a-d116-8e61-957c-ecc06f0a2970.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridOriginn2 Property

"Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridOriginn2 { get; }
```